; domain
(define (domain vincentland)
    (:requirements :action-costs)
    (:predicates
        (location ?l)
        (item ?i)
        (information ?info)
        (character ?c)
        (defended ?c)
        (sneaky ?c)
        (has ?cl ?i)
        (at ?c ?l)
        (player ?p)
        (cooperative ?c)
        (wants ?c ?i)
        (dead ?c)
        (weapon ?w)
        (adjacent ?la ?lb)
        (monster ?m)
        (captive ?captor ?captive)
        (damaged ?i)
        (experimented ?i)
        (explored ?l)
        (used ?i))

    (:functions
        (total-cost))

    (:action capture
        :parameters (?p ?char ?loc)
        :precondition (and (player ?p) (character ?char) (location ?loc) (at ?p ?loc) (at ?char ?loc))
        :effect (and (captive ?p ?char) (increase (total-cost) 2)))

    (:action damage
        :parameters (?p ?i ?loc ?w)
        :precondition (and (player ?p) (item ?i) (location ?loc) (weapon ?w) (or (and (at ?p ?loc) (has ?loc ?i)) (has ?p ?i)) (has ?p ?w))
        :effect (and (damaged ?i) (increase (total-cost) 2)))

    (:action defend
        :parameters (?p ?todefend ?loc)
        :precondition (and (player ?p) (or (character ?todefend) (item ?todefend)) (location ?loc) (at ?p ?loc) (or (at ?todefend ?loc) (has ?loc ?todefend)))
        :effect (and (defended ?todefend) (increase (total-cost) 2)))

    (:action escort
        :parameters (?p ?charA ?locA ?locB)
        :precondition (and (player ?p) (character ?charA) (location ?locA) (location ?locB) (at ?p ?locA) (at ?charA ?locA) (cooperative ?charA))
        :effect (and (at ?p ?locB) (at ?charA ?locB) (not (at ?p ?locA)) (not (at ?charA ?locA)) (increase (total-cost) 4)))

    (:action exchange
        :parameters (?p ?char ?i2 ?i1 ?loc)
        :precondition (and (player ?p) (character ?char) (item ?i1) (item ?i2) (location ?loc) (has ?p ?i1) (has ?char ?i2) (at ?p ?loc) (at ?char ?loc))
        :effect (and (not (has ?p ?i1)) (has ?p ?i2) (not (has ?char ?i2)) (has ?char ?i1) (increase (total-cost) 1)))

    (:action experiment
        :parameters (?p ?i)
        :precondition (and (player ?p) (item ?i) (has ?p ?i))
        :effect (and (experimented ?i) (increase (total-cost) 2)))

    (:action explore
        :parameters (?p ?locA ?locB)
        :precondition (and (player ?p) (location ?locA) (location ?locB) (at ?p ?locA))
        :effect (and (explored ?locB) (not (at ?p ?locA)) (at ?p ?locB) (increase (total-cost) 3)))

    (:action getfromlocation
        :parameters (?p ?loc ?i)
        :precondition (and (player ?p) (location ?loc) (item ?i) (has ?loc ?i) (at ?p ?loc))
        :effect (and (has ?p ?i) (not (has ?loc ?i)) (increase (total-cost) 2)))

    (:action giveto
        :parameters (?p ?charB ?i ?loc)
        :precondition (and (character ?charB) (player ?p) (item ?i) (has ?p ?i) (location ?loc) (at ?charB ?loc) (at ?p ?loc))
        :effect (and (has ?charB ?i) (not (has ?p ?i)) (cooperative ?charB) (increase (total-cost) 2)))

    (:action move
        :parameters (?p ?to ?from)
        :precondition (and (location ?to) (location ?from) (player ?p) (at ?p ?from))
        :effect (and (at ?p ?to) (not (at ?p ?from)) (increase (total-cost) 2)))

    (:action kill
        :parameters (?p ?charA ?i ?loc ?w)
        :precondition (and (not (damaged ?w)) (player ?p) (or (character ?charA) (monster ?charA)) (at ?charA ?loc) (at ?p ?loc) (item ?i) (location ?loc) (has ?charA ?i) (weapon ?w) (has ?p ?w))
        :effect (and (not (character ?charA)) (has ?loc ?i) (dead ?charA) (item ?charA) (increase (total-cost) 3)))

    (:action listen
        :parameters (?p ?char ?loc ?info)
        :precondition (and (player ?p) (character ?char) (location ?loc) (at ?p ?loc) (at ?char ?loc) (information ?info) (has ?char ?info))
        :effect (and (has ?p ?info) (increase (total-cost) 2)))

    (:action read
        :parameters (?p ?loc ?i ?info)
        :precondition (and (player ?p) (item ?i) (information ?info) (location ?loc) (at ?p ?loc) (has ?loc ?i) (has ?i ?info))
        :effect (and (has ?p ?info) (increase (total-cost) 2)))

    (:action repair
        :parameters (?p ?loc ?i)
        :precondition (and (player ?p) (location ?loc) (item ?i) (damaged ?i) (or (and (at ?p ?loc) (has ?loc ?i))) (has ?p ?i))
        :effect (and (not (damaged ?i)) (increase (total-cost) 2)))


    (:action report
        :parameters (?p ?char ?info ?loc)
        :precondition (and (player ?p) (location ?loc) (character ?char) (information ?info) (at ?p ?loc) (at ?char ?loc) (has ?p ?info))
        :effect (and (has ?char ?info) (increase (total-cost) 2)))


    (:action spy
        :parameters (?p ?char ?loc ?info)
        :precondition (and (player ?p) (character ?char) (location ?loc) (at ?p ?loc) (at ?char ?loc) (sneaky ?p) (information ?info) (has ?char ?info))
        :effect (and (has ?p ?info) (increase (total-cost) 2)))


    (:action stealth
        :parameters (?p)
        :precondition (player ?p)
        :effect (and (sneaky ?p) (increase (total-cost) 2)))


    (:action take
        :parameters (?p ?char ?i2 ?loc)
        :precondition (and (player ?p) (or (character ?char) (monster ?char)) (item ?i2) (location ?loc) (has ?char ?i2) (at ?p ?loc) (at ?char ?loc) (or (cooperative ?char) (sneaky ?p)))
        :effect (and (has ?p ?i2) (not (has ?char ?i2)) (increase (total-cost) 2)))

    (:action use
        :parameters (?p ?i)
        :precondition (and (player ?p) (item ?i) (has ?p ?i))
        :effect (and (used ?i) (increase (total-cost) 1)))

)

; problem
(define (problem lumberjack)
(:domain vincentland)
(:objects you slime forge baker ore fireball sword village spellbook field blacksmith guard troll forest pelt lumberjack shop wolf daughter king castle secret hammer wheat gel bakery cave merchant )
(:init (adjacent castle village)
(at daughter cave)
(at king field)
(at slime village)
(has field wheat)
(has castle spellbook)
(captive troll daughter)
(has blacksmith hammer)
(has wolf pelt)
(location cave)
(item ore)
(adjacent field cave)
(character merchant)
(monster wolf)
(character lumberjack)
(has king secret)
(location castle)
(character blacksmith)
(item sword)
(item pelt)
(character baker)
(item gel)
(has cave ore)
(at wolf village)
(at troll village)
(player you)
(at lumberjack village)
(= (total-cost) 0)
(character guard)
(location forge)
(weapon hammer)
(has troll hammer)
(monster troll)
(item spellbook)
(at you bakery)
(at guard shop)
(location shop)
(adjacent village forest)
(adjacent village field)
(character king)
(has spellbook fireball)
(adjacent village shop)
(location forest)
(information secret)
(cooperative baker)
(adjacent village forge)
(at merchant shop)
(location bakery)
(item hammer)
(location field)
(has slime gel)
(monster slime)
(at blacksmith forge)
(adjacent village bakery)
(weapon sword)
(character daughter)
(has you sword)
(location village)
(at baker bakery)
(information fireball)
(item wheat)
)
(:goal (and (cooperative king) (dead wolf)))
(:metric minimize (total-cost)))

; plan
1. (escort you baker bakery village)
   deleted: (at you bakery) (at baker bakery)
   added: (at you village) (at baker village)
   goals met: 0 of 2
2. (kill you wolf pelt village sword)
   added: (has village pelt) (dead wolf) (item wolf)
   goals met: 1 of 2
3. (escort you baker village field)
   deleted: (at you village) (at baker village)
   added: (at you field) (at baker field)
   goals met: 1 of 2
4. (giveto you king sword field)
   deleted: (has you sword)
   added: (has king sword) (cooperative king)
   goals met: 2 of 2
